root_fields = (
    ("Level", "Уровень"),
    ("Program", "ОП"),
    ("Year", "Курс"),
    ("Module", "Модуль"),
    ("Discipline", "Предмет"),
    ("Teacher", "Преподаватель"),
    ("MeanMark", "Средняя оценка"),
    ("MeanPositiveMark", "Средняя ненулевая оценка"),
    ("MarkSum", "Сумма оценок"),
    ("MarkCount", "Количество оценок"),
    ("MarkPositiveCount", "Количество ненулевых оценок"),
    ("10", "Количество 10"),
    ("9", "Количество 9"),
    ("8", "Количество 8"),
    ("7", "Количество 7"),
    ("6", "Количество 6"),
    ("5", "Количество 5"),
    ("4", "Количество 4"),
    ("3", "Количество 3"),
    ("2", "Количество 2"),
    ("1", "Количество 1"),
    ("0", "Количество 0"),
)
root_field_to_text = dict(root_fields)
root_text_to_field = {b: a for a, b in root_fields}


students_fields = (
    ("Name", "Имя"),
    ("Group", "Группа"),
    ("Program", "ОП"),
    ("Year", "Курс"),
    ("MeanMark", "Средняя оценка"),
    ("MeanPositiveMark", "Средняя ненулевая оценка"),
    ("MarkSum", "Сумма оценок"),
    ("MarkCount", "Количество оценок"),
    ("MarkPositiveCount", "Количество ненулевых оценок"),
    ("10", "Количество 10"),
    ("9", "Количество 9"),
    ("8", "Количество 8"),
    ("7", "Количество 7"),
    ("6", "Количество 6"),
    ("5", "Количество 5"),
    ("4", "Количество 4"),
    ("3", "Количество 3"),
    ("2", "Количество 2"),
    ("1", "Количество 1"),
    ("0", "Количество 0"),
)
students_field_to_text = dict(students_fields)
students_text_to_field = {b: a for a, b in students_fields}

scale_transform = {
    0: 0,
    1: 0,
    2: 0,
    3: 0,
    4: 1,
    5: 1,
    6: 2,
    7: 2,
    8: 3,
    9: 3,
    10: 3,
}
